In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns
%matplotlib inline
import pickle

In [4]:
dataset = pd.read_csv('hiring.csv')
dataset

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [15]:
dataset.rename(columns = {'test_score(out of 10)':'test_score','interview_score(out of 10)':'interview_score',
       'salary($)':'salary'},inplace = True)

In [16]:
dataset['experience'].fillna(0,inplace = True)

In [17]:
dataset['test_score'].fillna(dataset['test_score'].mean(),inplace = True)
dataset

  experience  test_score  interview_score  salary
0          0    8.000000                9   50000
1          0    8.000000                6   45000
2       five    6.000000                7   60000
3        two   10.000000               10   65000
4      seven    9.000000                6   70000
5      three    7.000000               10   62000
6        ten    7.857143                7   72000
7     eleven    7.000000                8   80000

In [20]:
## splitting the data
x = dataset.iloc[ :,:3]
x.head()

  experience  test_score  interview_score
0          0         8.0                9
1          0         8.0                6
2       five         6.0                7
3        two        10.0               10
4      seven         9.0                6

In [21]:
## converting the words to integer values
def convert_to_int(word):
    word_dict = {'one':1,'two':2,'three':3,'four':4,'five':5,'six':6,'seven':7,'eight':8,'nine':9,'ten':10,'eleven':11,'zero':0,0:0}
    return word_dict[word]

In [22]:
x['experience'] =x['experience'].apply(lambda x: convert_to_int(x))
y=dataset.iloc[:,-1]

In [23]:
x

   experience  test_score  interview_score
0           0    8.000000                9
1           0    8.000000                6
2           5    6.000000                7
3           2   10.000000               10
4           7    9.000000                6
5           3    7.000000               10
6          10    7.857143                7
7          11    7.000000                8

In [24]:
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary, dtype: int64

In [26]:
# splitting of train and test dta
#since we have a very small data ,we will train our model with all available data.

from sklearn.linear_model import LinearRegression
regressor = LinearRegression()

In [27]:
##fitting the model with training data
regressor.fit(x,y)

LinearRegression()

In [28]:
#saving model with traing data
pickle.dump(regressor,open('ml_model.pkl','wb'))

In [30]:
#loading the model to compare the results
model = pickle.load(open('ml_model.pkl','rb'))

In [31]:
print(model.predict([[2,9,6]]))

[53290.89255945]

c:\python\python37\lib\site-packages\sklearn\base.py:451: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  "X does not have valid feature names, but"